Revit 2024 API
FamilySymbol.GetStructuralSection Method
 Gets the structural section from element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public StructuralSection GetStructuralSection()
Visual Basic
Public Function GetStructuralSection As StructuralSection
Visual C++
public:
StructuralSection^ GetStructuralSection()
Return Value
 The structural section. null if the family symbol does not contain a structural section.
Remarks
 Only beams, braces and structural columns can have a structural section. To check if the element can have structural section use the [!:Family.HasStructuralSection()] method.
See Also
FamilySymbol Class
Autodesk.Revit.DB Namespace